Truss reference must form a continuous chain of one or more sketch lines.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId TrussSegmentedReference { get; }
  Visual Basic
Public Shared ReadOnly Property TrussSegmentedReference As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ TrussSegmentedReference {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace